<a href="https://colab.research.google.com/github/NuttakitDW/kbtg_data/blob/master/model_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
import seaborn as sns
sns.set(style="ticks")
import matplotlib.pyplot as plt

In [10]:
#version 4
data = pd.read_csv('https://raw.githubusercontent.com/NuttakitDW/kbtg_data/master/train_data_v4.csv')
test_X = pd.read_csv('https://raw.githubusercontent.com/NuttakitDW/kbtg_data/master/test_data_v4.csv')
data.head()

   id  gender  ocp_cd  age  ...  kp_txn_amt     cd_ex  cc_month_mean  kp_month_mean
0   1       2     9.0    5  ...      3500.0   44700.0        11175.0   3.500000e+03
1   2       2     3.0    4  ...    210000.0   65200.0        14385.0   3.500000e+04
2   3       2     1.0    3  ...    139700.0       0.0            0.0   2.328333e+04
3   4       2     3.0    5  ...   6076100.0  770000.0       500000.0   1.012683e+06
4   5       2     9.0    4  ...         0.0   12000.0         6000.0   0.000000e+00

[5 rows x 10 columns]

In [11]:
test_X.head()

      id  gender  ocp_cd  ...    cd_ex  cc_month_mean  kp_month_mean
0  50001       1     9.0  ...  31800.0   10600.000000   10766.666667
1  50002       1     9.0  ...   5900.0    2950.000000   15616.666667
2  50003       1     3.0  ...      0.0       0.000000   33750.000000
3  50004       2     3.0  ...   7200.0    1440.000000    1833.333333
4  50005       1     3.0  ...  14800.0    4933.333333   32583.333333

[5 rows x 10 columns]

In [28]:
data['overall'] = data['kp_txn_amt'] + data['cd_ex']
data.head()

   id  gender  ocp_cd  age  ...     cd_ex  cc_month_mean  kp_month_mean    overall
0   1       2     9.0    5  ...   44700.0        11175.0   3.500000e+03    48200.0
1   2       2     3.0    4  ...   65200.0        14385.0   3.500000e+04   275200.0
2   3       2     1.0    3  ...       0.0            0.0   2.328333e+04   139700.0
3   4       2     3.0    5  ...  770000.0       500000.0   1.012683e+06  6846100.0
4   5       2     9.0    4  ...   12000.0         6000.0   0.000000e+00    12000.0

[5 rows x 11 columns]

In [0]:
test_X['overall'] = test_X['kp_txn_amt'] + test_X['cd_ex']

In [0]:
y = data.income
X = data.drop(['income'], axis=1)
feature = ['ocp_cd', 'age', 'cd_ex', 'kp_txn_amt', 'kp_txn_count', 'gender', 'cc_month_mean', 'kp_month_mean', 'overall']
X = X[feature]

X_train, X_valid, y_train, y_valid = train_test_split(X, y, train_size=0.8, test_size=0.2, random_state=0)

In [0]:
from sklearn.metrics import mean_absolute_error, r2_score
from sklearn.ensemble import RandomForestRegressor

rdf = RandomForestRegressor(n_estimators=100, random_state=1)

rdf.fit(X_train, y_train)
preds = rdf.predict(X_valid)

In [42]:
# Evaluate the model
rs = r2_score(y_valid, preds)
ms = mean_absolute_error(y_valid, preds)
print('mae:', ms)

mae: 26133.32109253168

In [0]:
test_X.head()

      id  gender  ocp_cd  age     cd+kp  kp_txn_count  kp_txn_amt    cd_ex
0  50001       1     9.0    3   96400.0          28.0     64600.0  31800.0
1  50002       1     9.0    4   99600.0         131.0     93700.0   5900.0
2  50003       1     3.0    4  202500.0          83.0    202500.0      0.0
3  50004       2     3.0    4   18200.0          20.0     11000.0   7200.0
4  50005       1     3.0    4  210300.0          67.0    195500.0  14800.0

In [0]:
res = rdf.predict(test_X[feature])

In [0]:
from google.colab import files

output = pd.DataFrame({'id': test_X['id'],
                       'income': res})


output.to_csv('submission2.csv', index=False)
files.download('submission2.csv')

In [0]:
output.head()

      id        income
0  50001  27680.000000
1  50002  24460.000000
2  50003  34840.000000
3  50004  18866.666667
4  50005  38090.000000